import telebot
import schedule
import time
import threading
from datetime import datetime

bot = telebot.TeleBot('7947545435:AAE5F9sFq0FKiBXHX6W97GeMWOdHlalFjKY')
CHAT_ID = '-1002209365726'

# Функция для отправки сообщения
def send_message(text):
    try:
        print(f"{datetime.now()} Отправка сообщения в чат с ID: {CHAT_ID}\nТекст сообщения: {text}")
        bot.send_message(CHAT_ID, text)
    except Exception as e:
        print(f'Ошибка при отправке сообщения в будний день: {e}')

# Функция для запуска планировщика
def run_scheduler():
    while True:
        schedule.run_pending()
        time.sleep(1)



@bot.message_handler(commands=['start'])
def start_message(message):
    bot.send_message(message.chat.id, "Привет, Квадроберы!!! Я бот, который будет напоминать вам, что нужно делать! 😁")


# Сообщения для отправки
messages = [
    "Всем доброе утро! Выполняем планы, зарабатываем бабосики c:",
    "Коллеги, вносим температуру холодильников за утро в лк!",
    "Коллеги, вносим фотоотчёт!",
    "Коллеги, напониманаю про отчет!\nНапитки план/факт,\nпремиум (количество проданных),\nтри шоколада (количество проданных),\nсмесь орехов (количество проданных),\nнаборы орехов (количество проданных).\n\n\nВсем Удачи в выполнение плана!",
    "Коллеги, вносим выпечку в привоз(в лк)!",
    "Коллеги, вносим температуру холодильников за 14:00 в лк!",
    "Коллеги, напониманаю про отчет!",
    "Коллеги, начинаем вносить остатки!",
    "Коллеги, начинаем корректировать остатки!",
    "Коллеги, вносим температуру холодильников за вечер в лк!",
    "Коллеги, выдыхаем, рабочий день почти закончился! Корректируем остатки, вносим финансы, сдаем инкассацию!",
    "Всем хорошего вечера и доброй ночи!",
]

# Времена для отправки сообщений
times = [
    "08:00", "08:30", "10:30", "11:30", "12:00",
    "14:00", "15:30", "17:00", "18:30", "19:00",
    "20:00", "20:50",
]

#Все сообщение по времени
for i in range(len(messages)):
    schedule.every().day.at(times[i]).do(send_message, messages[i])

# Запускаем планировщик в отдельном потоке
threading.Thread(target=run_scheduler, daemon=True).start()

bot.polling(none_stop=True)